zephyrproject-rtos/hal_silabs/si32/si32Hal/sim3c1xx/SI32_SIM3C1XX_LOCK_A_Registers.h
#define SI32_LOCK_A_PERIPHLOCK0_EVREGL_MASK  0x04000000
#define SI32_LOCK_A_PERIPHLOCK0_EVREGL_SHIFT  26
// Unlock the External Regulator (EXTVREG0) Module registers.
#define SI32_LOCK_A_PERIPHLOCK0_EVREGL_UNLOCKED_VALUE  0
#define SI32_LOCK_A_PERIPHLOCK0_EVREGL_UNLOCKED_U32 \
   (SI32_LOCK_A_PERIPHLOCK0_EVREGL_UNLOCKED_VALUE << SI32_LOCK_A_PERIPHLOCK0_EVREGL_SHIFT)
// Lock the External Regulator (EXTVREG0) Module registers (bits can still be
// read).
#define SI32_LOCK_A_PERIPHLOCK0_EVREGL_LOCKED_VALUE  1
#define SI32_LOCK_A_PERIPHLOCK0_EVREGL_LOCKED_U32 \
   (SI32_LOCK_A_PERIPHLOCK0_EVREGL_LOCKED_VALUE << SI32_LOCK_A_PERIPHLOCK0_EVREGL_SHIFT)

#define SI32_LOCK_A_PERIPHLOCK0_IVCL_MASK  0x10000000
#define SI32_LOCK_A_PERIPHLOCK0_IVCL_SHIFT  28
// Unlock the IVC0 Module registers.
#define SI32_LOCK_A_PERIPHLOCK0_IVCL_UNLOCKED_VALUE  0
#define SI32_LOCK_A_PERIPHLOCK0_IVCL_UNLOCKED_U32 \
   (SI32_LOCK_A_PERIPHLOCK0_IVCL_UNLOCKED_VALUE << SI32_LOCK_A_PERIPHLOCK0_IVCL_SHIFT)
// Lock the IVC0 Module registers (bits can still be read).
#define SI32_LOCK_A_PERIPHLOCK0_IVCL_LOCKED_VALUE  1
#define SI32_LOCK_A_PERIPHLOCK0_IVCL_LOCKED_U32 \
   (SI32_LOCK_A_PERIPHLOCK0_IVCL_LOCKED_VALUE << SI32_LOCK_A_PERIPHLOCK0_IVCL_SHIFT)



struct SI32_LOCK_A_PERIPHLOCK1_Struct
{
   union
   {
      struct
      {
         // PMU Module Lock Enable
         volatile uint32_t PMUL: 1;
                  uint32_t reserved0: 31;
      };
      volatile uint32_t U32;
   };
};

#define SI32_LOCK_A_PERIPHLOCK1_PMUL_MASK  0x00000001
#define SI32_LOCK_A_PERIPHLOCK1_PMUL_SHIFT  0
// Unlock the PMU Module registers.
#define SI32_LOCK_A_PERIPHLOCK1_PMUL_UNLOCKED_VALUE  0
#define SI32_LOCK_A_PERIPHLOCK1_PMUL_UNLOCKED_U32 \
   (SI32_LOCK_A_PERIPHLOCK1_PMUL_UNLOCKED_VALUE << SI32_LOCK_A_PERIPHLOCK1_PMUL_SHIFT)
// Lock the PMU Module registers (bits can still be read).
#define SI32_LOCK_A_PERIPHLOCK1_PMUL_LOCKED_VALUE  1
#define SI32_LOCK_A_PERIPHLOCK1_PMUL_LOCKED_U32 \
   (SI32_LOCK_A_PERIPHLOCK1_PMUL_LOCKED_VALUE << SI32_LOCK_A_PERIPHLOCK1_PMUL_SHIFT)



typedef struct SI32_LOCK_A_Struct
{
   struct SI32_LOCK_A_KEY_Struct                   KEY            ; // Base Address + 0x0
   uint32_t                                        reserved0;
   uint32_t                                        reserved1;
   uint32_t                                        reserved2;
   uint32_t                                        reserved3[4];
   struct SI32_LOCK_A_PERIPHLOCK0_Struct           PERIPHLOCK0    ; // Base Address + 0x20
   volatile uint32_t                               PERIPHLOCK0_SET;
   volatile uint32_t                               PERIPHLOCK0_CLR;
   uint32_t                                        reserved4;
   uint32_t                                        reserved5[4];
   struct SI32_LOCK_A_PERIPHLOCK1_Struct           PERIPHLOCK1    ; // Base Address + 0x40
   volatile uint32_t                               PERIPHLOCK1_SET;
   volatile uint32_t                               PERIPHLOCK1_CLR;
   uint32_t                                        reserved6;
} SI32_LOCK_A_Type;

#ifdef __cplusplus
}
#endif

#endif // __SI32_LOCK_A_REGISTERS_H__

//-eof--------------------------------------------------------------------------

